In [1]:
# Import dependencies
import re
import json
import pandas as pd

In [2]:
# Read the contacts string data into a Pandas DataFrame
contacts_string_df = pd.read_csv("./contacts_string_data.csv")
contacts_string_df.head()

                                        contact_info
0  contact_id 4661 name Cecilia Velasco email cec...
1  contact_id 3765 name Mariana Ellis email maria...
2  contact_id 4187 name Sofie Woods email sofie.w...
3  contact_id 4941 name Jeanette Iannotti email j...
4  contact_id 2199 name Samuel Sorgatz email samu...

In [6]:
# Extract the four digit id number.
contacts_string_df["contact_id"] = contacts_string_df["contact_info"].str.extract(r'(\d{4})')
contacts_string_df.head()

                                        contact_info contact_id
0  contact_id 4661 name Cecilia Velasco email cec...       4661
1  contact_id 3765 name Mariana Ellis email maria...       3765
2  contact_id 4187 name Sofie Woods email sofie.w...       4187
3  contact_id 4941 name Jeanette Iannotti email j...       4941
4  contact_id 2199 name Samuel Sorgatz email samu...       2199

### Special characters:
Backslash followed by lowercase d (\d): Matches any digit from 0 to 9.

Backslash followed by uppercase D (\D): Matches any character that’s not a digit.

Backslash followed by lowercase w (\w): Matches a word character (that is, a letter, a digit, or an underscore).

Backslash followed by uppercase W (\W): Matches any character that’s not a word character (that is, anything other than a letter, a digit, or an underscore). Examples include a space or a punctuation character.

Backslash followed by lowercase s (\s): Matches any whitespace character (including a space, a tab, or a newline character).

Backslash followed by uppercase S (\S): Matches any character that’s not a whitespace character.

In [9]:
# Extract the first and last name after the word "name".
name = re.findall(r'([^nameil\s+][A-Za-z]+\s+[A-Za-z]+)', string_data)
name

NameError: name 'string_data' is not defined

In [10]:
# Extract the name.
contacts_string_df["name"] = contacts_string_df["contact_info"].str.extract(r'([^nameil\s+][A-Za-z]+\s+[A-Za-z]+)')
contacts_string_df.head()

,contact_info,contact_id,name
0,contact_id 4661 name Cecilia Velasco email cec...,4661,Cecilia Velasco
1,contact_id 3765 name Mariana Ellis email maria...,3765,Mariana Ellis
2,contact_id 4187 name Sofie Woods email sofie.w...,4187,Sofie Woods
3,contact_id 4941 name Jeanette Iannotti email j...,4941,Jeanette Iannotti
4,contact_id 2199 name Samuel Sorgatz email samu...,2199,Samuel Sorgatz

In [11]:
contacts_string_df["email"] = contacts_string_df["contact_info"].str.extract(r'(\S+@\S+)')
contacts_string_df.head()

,contact_info,contact_id,name,email
0,contact_id 4661 name Cecilia Velasco email cec...,4661,Cecilia Velasco,cecilia.velasco@rodrigues.fr
1,contact_id 3765 name Mariana Ellis email maria...,3765,Mariana Ellis,mariana.ellis@rossi.org
2,contact_id 4187 name Sofie Woods email sofie.w...,4187,Sofie Woods,sofie.woods@riviere.com
3,contact_id 4941 name Jeanette Iannotti email j...,4941,Jeanette Iannotti,jeanette.iannotti@yahoo.com
4,contact_id 2199 name Samuel Sorgatz email samu...,2199,Samuel Sorgatz,samuel.sorgatz@gmail.com